hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_usart.c
    /* Check USARTx instance and pstcInit */
    if ((!IS_USART_INSTANCE(USARTx)) || (NULL == pstcInit))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_CLOCK_MODE(pstcInit->u32ClkMode));
    DDL_ASSERT(IS_USART_NOISE_FILTER(pstcInit->u32NoiseFilterState));
    DDL_ASSERT(IS_USART_CLOCK_PRESCALER_DIV(pstcInit->u32ClkPrescaler));
    DDL_ASSERT(IS_USART_OVERSAMPLING_BITS(pstcInit->u32OversamplingBits));
    DDL_ASSERT(IS_USART_SB_DETECT_POLARITY(pstcInit->u32SbDetectPolarity));

    /* Disbale TX/RX && clear interrupt flag */
    WRITE_REG(USARTx->CR1, (USART_CR1_CPE | USART_CR1_CFE | USART_CR1_CORE));

    /* Set CR1 */
    MODIFY_REG(USARTx->CR1,
               (USART_CR1_SLME | USART_CR1_PS | USART_CR1_PCE |                \
                USART_CR1_M | USART_CR1_OVER8 | USART_CR1_MS  |                \
                USART_CR1_ML | USART_CR1_NFE | USART_CR1_SBS),                 \
               (USART_MODE_UART | pstcInit->u32OversamplingBits |              \
                pstcInit->u32NoiseFilterState | pstcInit->u32SbDetectPolarity));

    /* Set CR2 */
    WRITE_REG(USARTx->CR2, (pstcInit->u32ClkMode | USART_CR2_LINEN));

    /* Set CR3 */
    WRITE_REG(USARTx->CR3, pstcInit->u32HwFlowCtrl);

    /* Set PR */
    WRITE_REG(USARTx->PR, pstcInit->u32ClkPrescaler);

    /* Set baudrate */
    enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_lin_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_lin_init_t structure (USARTx unit LIN function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: UpstcInit == NULL
 */
en_result_t USART_LinStructInit(stc_lin_init_t *pstcInit)
{
    /* Check parameters */
    if (NULL == pstcInit)
    {
        return ErrorInvalidParameter;
    }

    pstcInit->u32Baudrate = 9600;
    pstcInit->u32ClkMode = USART_INTCLK_NONE_OUTPUT;
    pstcInit->u32ClkPrescaler = USART_CLK_PRESCALER_DIV1;
    pstcInit->u32NoiseFilterState = USART_NOISE_FILTER_DISABLE;
    pstcInit->u32OversamplingBits = USART_OVERSAMPLING_BITS_16;
    pstcInit->u32SbDetectPolarity = USART_SB_DETECT_LOW;
    pstcInit->u32HwFlowCtrl = USART_HWFLOWCTRL_RTS;

    return Ok;
}

/**
 * @brief  Initialize CLKSYNC function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_clksync_init_t structure (USARTx unit CLKSYNC function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance or pstcInit == NULL
 */
en_result_t USART_ClkSyncInit(M0P_USART_TypeDef *USARTx,
                                        const stc_clksync_init_t *pstcInit)
{
    en_result_t enRet;

    /* Check TMRBx instance and pstcInit */
    if ((!IS_USART_INSTANCE(USARTx)) || (NULL == pstcInit))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_CLOCK_MODE(pstcInit->u32ClkMode));
    DDL_ASSERT(IS_USART_HWFLOWCTRL(pstcInit->u32HwFlowCtrl));
    DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(pstcInit->u32BitDirection));
    DDL_ASSERT(IS_USART_CLOCK_PRESCALER_DIV(pstcInit->u32ClkPrescaler));

    /* Disbale TX/RX && clear interrupt flag */
    WRITE_REG(USARTx->CR1, (USART_CR1_CPE | USART_CR1_CFE | USART_CR1_CORE));

    /* Set CR1 */
    MODIFY_REG(USARTx->CR1,
               (USART_CR1_SLME | USART_CR1_PS | USART_CR1_PCE |                \
                USART_CR1_M | USART_CR1_OVER8 | USART_CR1_MS  |                \
                USART_CR1_ML | USART_CR1_NFE | USART_CR1_SBS),                 \
               (USART_MODE_CLKSYNC | pstcInit->u32BitDirection));

    /* Set CR2 */
    WRITE_REG(USARTx->CR2, pstcInit->u32ClkMode);

    /* Set CR3 */
    WRITE_REG(USARTx->CR3, pstcInit->u32HwFlowCtrl);

    /* Set PR */
    WRITE_REG(USARTx->PR, pstcInit->u32ClkPrescaler);

    /* Set baudrate */
    enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_clksync_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_clksync_init_t structure (USARTx unit CLKSYNC function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit == NULL
 */
en_result_t USART_ClkSyncStructInit(stc_clksync_init_t *pstcInit)
{
    /* Check parameter */
    if (NULL == pstcInit)
    {
        return ErrorInvalidParameter;
    }

    pstcInit->u32Baudrate = 9600;
    pstcInit->u32ClkMode = USART_INTCLK_NONE_OUTPUT;
    pstcInit->u32ClkPrescaler = USART_CLK_PRESCALER_DIV1;
    pstcInit->u32BitDirection = USART_LSB;
    pstcInit->u32HwFlowCtrl = USART_HWFLOWCTRL_RTS;

    return Ok;
}

/**
 * @brief  De-Initialize USART function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_DeInit(M0P_USART_TypeDef *USARTx)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

