hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_usart.c
    SET_BIT(USARTx->CR1, u32Flag);

    return Ok;
}

/**
 * @brief  Set USART silence mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SilenceModeCmd(M0P_USART_TypeDef *USARTx, en_functional_state_t enNewSta)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    (Enable == enNewSta) ? SET_BIT(USARTx->CR1, USART_CR1_SLME) : CLEAR_BIT(USARTx->CR1, USART_CR1_SLME);

    return Ok;
}

/**
 * @brief  Get USART silence mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg Enable:               UART silence mode
 *           @arg Disable:              UART normal mode
 */
en_functional_state_t USART_GetSilenceModeState(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR1, USART_CR1_SLME) ? Enable : Disable;
}

/**
 * @brief  Set USART transmission type.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32Type                 USART transmission content type
 *         This parameter can be one of the following values:
 *           @arg USART_TRANSMISSION_ID     USART transmission content type is processor ID
 *           @arg USART_TRANSMISSION_DATA   USART transmission content type is frame data
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetTransmissionType(M0P_USART_TypeDef *USARTx, uint32_t u32Type)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_TRANSMISSION_TYPE(u32Type));

    MODIFY_REG(USARTx->DR, USART_DR_MPID, u32Type);

    return Ok;
}

/**
 * @brief  Get USART transmission type.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_TRANSMISSION_ID     USART transmission content type is processor ID
 *           @arg USART_TRANSMISSION_DATA   USART transmission content type is frame data
 */
uint32_t USART_GetTransmissionType(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->DR, USART_DR_MPID);
}

/**
 * @brief  Set USART parity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32Parity               USART parity
 *         This parameter can be one of the following values:
 *           @arg USART_PARITY_NONE:    Parity control disabled
 *           @arg USART_PARITY_ODD:     Parity control enabled and Odd Parity is selected
 *           @arg USART_PARITY_EVEN:    Parity control enabled and Even Parity is selected
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetParity(M0P_USART_TypeDef *USARTx, uint32_t u32Parity)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_PARITY_CONTROL(u32Parity));

    MODIFY_REG(USARTx->CR1, (USART_CR1_PS | USART_CR1_PCE), u32Parity);

    return Ok;
}

/**
 * @brief  Get USART parity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_PARITY_NONE:    Parity control disabled
 *           @arg USART_PARITY_ODD:     Parity control enabled and Odd Parity is selected
 *           @arg USART_PARITY_EVEN:    Parity control enabled and Even Parity is selected
 */
uint32_t USART_GetParity(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR1, (USART_CR1_PS | USART_CR1_PCE));
}

/**
 * @brief  Set USART data width.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32DataWidth            USART data width
 *         This parameter can be one of the following values:
 *           @arg USART_DATA_WIDTH_BITS_8:  8 bits word length : Start bit, 8 data bits, n stop bits
 *           @arg USART_DATA_WIDTH_BITS_9:  9 bits word length : Start bit, 9 data bits, n stop bits
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetDataWidth(M0P_USART_TypeDef *USARTx, uint32_t u32DataWidth)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_DATA_WIDTH(u32DataWidth));

    MODIFY_REG(USARTx->CR1, USART_CR1_M, u32DataWidth);

    return Ok;
}

/**
 * @brief  Get USART data width.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_DATA_WIDTH_BITS_8:  8 bits word length : Start bit, 8 data bits, n stop bits
 *           @arg USART_DATA_WIDTH_BITS_9:  9 bits word length : Start bit, 9 data bits, n stop bits
 */
uint32_t USART_GetDataWidth(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR1, USART_CR1_M);
}

/**
 * @brief  Set USART oversampling bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32OversamplingBits     USART oversampling bits
 *         This parameter can be one of the following values:
 *           @arg USART_OVERSAMPLING_BITS_8:    Oversampling by 8 bits
 *           @arg USART_OVERSAMPLING_BITS_16:   Oversampling by 16 bits
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetOversmaplingBits(M0P_USART_TypeDef *USARTx, uint32_t u32OversamplingBits)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_OVERSAMPLING_BITS(u32OversamplingBits));

    MODIFY_REG(USARTx->CR1, USART_CR1_OVER8, u32OversamplingBits);

    return Ok;
}

/**
 * @brief  Get USART oversampling bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_OVERSAMPLING_BITS_8:    Oversampling by 8 bits
 *           @arg USART_OVERSAMPLING_BITS_16:   Oversampling by 16 bits
 */
uint32_t USART_GetOversmaplingBits(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR1, USART_CR1_OVER8);
}

/**
 * @brief  Set USART mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32Mode                 USART mode
 *         This parameter can be one of the following values:
 *           @arg USART_MODE_UART:      UART mode
 *           @arg USART_MODE_CLKSYNC:   Clock synchronization
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetMode(M0P_USART_TypeDef *USARTx, uint32_t u32Mode)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_MODE_SEL(u32Mode));

