hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_usart.c
    MODIFY_REG(USARTx->CR1, USART_CR1_MS, u32Mode);

    return Ok;
}

/**
 * @brief  Get USART mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_MODE_UART:      UART mode
 *           @arg USART_MODE_CLKSYNC:   Clock synchronization
 */
uint32_t USART_GetMode(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR1, USART_CR1_MS);
}

/**
 * @brief  Set USART bit direction.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32BitDir               USART bit direction
 *         This parameter can be one of the following values:
 *           @arg USART_MSB:            MSB(Most Significant Bit)
 *           @arg USART_LSB:            LSB(Least Significant Bit)
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetBitDirection(M0P_USART_TypeDef *USARTx,
                                        uint32_t u32BitDir)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(u32BitDir));

    MODIFY_REG(USARTx->CR1, USART_CR1_ML, u32BitDir);

    return Ok;
}

/**
 * @brief  Get USART bit direction.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_MSB:            MSB(Most Significant Bit)
 *           @arg USART_LSB:            LSB(Least Significant Bit)
 */
uint32_t USART_GetBitDirection(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR1, USART_CR1_ML);
}

/**
 * @brief  Set USART start bit detect polarity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32Polarity             USART start bit detect polarity
 *         This parameter can be one of the following values:
 *           @arg USART_SB_DETECT_LOW:      Detect RX pin low level
 *           @arg USART_SB_DETECT_FALLING:  Detect RX pin falling edge
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetSbDetectPolarity(M0P_USART_TypeDef *USARTx,
                                            uint32_t u32Polarity)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_SB_DETECT_POLARITY(u32Polarity));

    MODIFY_REG(USARTx->CR1, USART_CR1_SBS, u32Polarity);

    return Ok;
}

/**
 * @brief  Get USART start bit detect polarity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_SB_DETECT_LOW:      Detect RX pin low level
 *           @arg USART_SB_DETECT_FALLING:  Detect RX pin falling edge
 */
uint32_t USART_GetSbDetectPolarity(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR1, USART_CR1_SBS);
}

/**
 * @brief  Set USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32ClkMode              USART clock mode
 *         This parameter can be one of the following values:
 *           @arg USART_EXTCLK:             Select external clock source.
 *           @arg USART_INTCLK_OUTPUT:      Select internal clock source and output clock.
 *           @arg USART_INTCLK_NONE_OUTPUT: Select internal clock source and don't output clock
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetClockMode(M0P_USART_TypeDef *USARTx, uint32_t u32ClkMode)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_CLOCK_MODE(u32ClkMode));

    MODIFY_REG(USARTx->CR2, USART_CR2_CLKC, u32ClkMode);

    return Ok;
}

/**
 * @brief  Get USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_EXTCLK:             Select external clock source.
 *           @arg USART_INTCLK_OUTPUT:      Select internal clock source and output clock.
 *           @arg USART_INTCLK_NONE_OUTPUT: Select internal clock source and don't output clock
 */
uint32_t USART_GetClockMode(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR2, USART_CR2_CLKC);
}

/**
 * @brief  Set USART stop bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32StopBits             USART stop bits
 *         This parameter can be one of the following values:
 *           @arg USART_STOP_BITS_1:    1 stop bit
 *           @arg USART_STOP_BITS_2:    2 stop bits
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetStopBits(M0P_USART_TypeDef *USARTx, uint32_t u32StopBits)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_STOP_BITS(u32StopBits));

    MODIFY_REG(USARTx->CR2, USART_CR2_STOP, u32StopBits);

    return Ok;
}

/**
 * @brief  Get USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_STOP_BITS_1:    1 stop bit
 *           @arg USART_STOP_BITS_2:    2 stop bits
 */
uint32_t USART_GetStopBits(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

