hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_usart.c
    return READ_BIT(USARTx->CR2, USART_CR2_STOP);
}

/**
 * @brief  Set UART half/full duplex selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32Mode                 USART half/full duplex selection
 *         This parameter can be one of the following values:
 *           @arg USART_HALFDUPLEX_MODE:USART half-duplex mode
 *           @arg USART_FULLDUPLEX_MODE:USART full-duplex mode
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetDuplexMode(M0P_USART_TypeDef *USARTx,
                                uint32_t u32Mode)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_UART_DUPLEX_MODE(u32Mode));

    MODIFY_REG(USARTx->CR3, USART_CR3_HDSEL, u32Mode);

    return Ok;
}

/**
 * @brief  Get USART half/full duplex.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_HALFDUPLEX_MODE:USART half-duplex mode
 *           @arg USART_FULLDUPLEX_MODE:USART full-duplex mode
 */
uint32_t USART_GetDuplexMode(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR3, USART_CR3_HDSEL);
}

/**
 * @brief  Set UART hardware flow control CTS/RTS selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32HwFlowCtrl           USART hardware flow control CTS/RTS selection
 *         This parameter can be one of the following values:
 *           @arg USART_HWFLOWCTRL_CTS: UART hardware flow control CTS mode
 *           @arg USART_HWFLOWCTRL_RTS: UART hardware flow control RTS mode
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetHwFlowCtrl(M0P_USART_TypeDef *USARTx,
                                uint32_t u32HwFlowCtrl)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_HWFLOWCTRL(u32HwFlowCtrl));

    MODIFY_REG(USARTx->CR3, USART_CR3_CTSE, u32HwFlowCtrl);

    return Ok;
}

/**
 * @brief  Get USART hardware flow control CTS/RTS selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_HWFLOWCTRL_CTS: UART hardware flow control CTS mode
 *           @arg USART_HWFLOWCTRL_RTS: UART hardware flow control RTS mode
 */
uint32_t USART_GetHwFlowCtrl(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->CR3, USART_CR3_CTSE);
}

/**
 * @brief  Set USART clock prescaler division.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32PrescalerDiv         USART clock prescaler division.
 *         This parameter can be one of the following values:
 *           @arg USART_CLK_PRESCALER_DIV1:     PCLK
 *           @arg USART_CLK_PRESCALER_DIV4:     PCLK/4
 *           @arg USART_CLK_PRESCALER_DIV16:    PCLK/16
 *           @arg USART_CLK_PRESCALER_DIV64:    PCLK/64
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetClkPrescaler(M0P_USART_TypeDef *USARTx,
                                    uint32_t u32PrescalerDiv)
{
    /* Check USARTx instance */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_USART_CLOCK_PRESCALER_DIV(u32PrescalerDiv));

    MODIFY_REG(USARTx->PR, USART_PR_PSC, u32PrescalerDiv);

    return Ok;
}

/**
 * @brief  Get USART clock prescaler division.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_CLK_PRESCALER_DIV1:     PCLK
 *           @arg USART_CLK_PRESCALER_DIV4:     PCLK/4
 *           @arg USART_CLK_PRESCALER_DIV16:    PCLK/16
 *           @arg USART_CLK_PRESCALER_DIV64:    PCLK/64
 */
uint32_t USART_GetClkPrescaler(M0P_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_BIT(USARTx->PR, USART_PR_PSC);
}

/**
 * @brief  Set USART baudrate.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 *           @arg M0P_USART4:           USART unit 4 instance register base
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [in] pf32Err                 E(%) baudrate error rate
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance or DIV_Integer is out of range
 */
en_result_t USART_SetBaudrate(M0P_USART_TypeDef *USARTx,
                                    uint32_t u32Baudrate,
                                    float32_t *pf32Err)
{
    uint32_t B;
    uint32_t C;
    uint32_t OVER8;
    uint32_t DIV_Integer;
    uint32_t u32Prescaler = 0u;
    uint32_t u32Mode = READ_BIT(USARTx->CR1, USART_CR1_MS);

    /* Check USARTx pointer */
    if (!IS_USART_INSTANCE(USARTx))
    {
        return ErrorInvalidParameter;
    }

