hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_usart.c
    u32Prescaler = READ_BIT(USARTx->PR, USART_PR_PSC);

    B = u32Baudrate;
    C = (SystemCoreClock / (1 << (u32Prescaler * 2)));
    OVER8 = READ_BIT(USARTx->CR1, USART_CR1_OVER8) ? 1u : 0u;

    if (USART_MODE_UART == u32Mode)
    {
        /* UART Baudrate Calculation Formula */
        /* B = C / (8 * (2 - OVER8) * (DIV_Integer + 1)) */
        DIV_Integer = (C * 10) / (B * 8 * (2 - OVER8));
    }
    else
    {
        /* Clock Sync Baudrate Calculation Formula */
        /* B = C / (4 * (DIV_Integer + 1)) */
        DIV_Integer = (C * 10) / (B * 4);
    }

    if (DIV_Integer % 10 < 5)
    {
        DIV_Integer -= 10;
    }

    DIV_Integer /= 10;

    if (DIV_Integer > 0xFF)
    {
        DDL_ASSERT(NULL);
        return ErrorInvalidParameter;
    }

    if (pf32Err)
    {
        if (USART_MODE_UART == u32Mode)
        {
            /* UART Baudrate Error Calculation Formula */
            /* E(%) = C / (8 * (2 - OVER8) * (DIV_Integer + 1) * B) - 1 */
            *pf32Err = ((float64_t)C) / (8 * (2 - OVER8) * (DIV_Integer + 1) * B) - 1.0;
        }
        else
        {
            /* Clock Sync Baudrate Error Calculation Formula */
            /* E(%) = C / (4 * (DIV_Integer + 1) * B) - 1 */
            *pf32Err = ((float64_t)C) / (4 * (DIV_Integer + 1) * B) - 1.0;
        }
    }

    /* Set USART_BRR register bits:DIV_Integer */
    WRITE_REG(USARTx->BRR, (DIV_Integer << USART_BRR_DIV_INTEGER_POS));

    return Ok;
}

/**
 * @}
 */

#endif /* DDL_USART_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
